ankuns/nrfx/bsp/stable/mdk/nrf7140_lmac.svd
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>DMACOMPPARAMS1H</name>
              <description>DMA_COMP_PARAMS_1 is a constant read-only register that contains encoded information about the component parameter settings.</description>
              <addressOffset>0x05C</addressOffset>
              <access>read-write</access>
              <resetValue>0x3120090C</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BIGENDIAN</name>
                  <description>The value of this register is derived from the DMAH_BIG_ENDIAN coreConsultant parameter.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>INTRIO</name>
                  <description>The value of this register is derived from the DMAH_INTR_IO coreConsultant parameter.</description>
                  <lsb>1</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ALL_INT</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TYPE_INT</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>COMBINED_INT</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MAXABRST</name>
                  <description>The value of this register is derived from the DMAH_MABRST coreConsultant parameter.</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDDMACOMPPARAMS1</name>
                  <description>Reserved field- read-only</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>NUMCHANNELS</name>
                  <description>The value of this register is derived from the DMAH_NUM_CHANNELS coreConsultant parameter.</description>
                  <lsb>8</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_1</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_2</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_3</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_4</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_5</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_6</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_7</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_CHANNEL_8</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>NUMMASTERINT</name>
                  <description>The value of this register is derived from the DMAH_NUM_MASTER_INT coreConsultant parameter.</description>
                  <lsb>11</lsb>
                  <msb>12</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NUM_MST_INTERFACE_1</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_MST_INTERFACE_2</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_MST_INTERFACE_3</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NUM_MST_INTERFACE_4</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SHDATAWIDTH</name>
                  <description>The value of this register is derived from the DMAH_S_HDATA_WIDTH coreConsultant parameter.</description>
                  <lsb>13</lsb>
                  <msb>14</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_32</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_64</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_128</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_256</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>M4HDATAWIDTH</name>
                  <description>The value of this register is derived from the DMAH_M4_HDATA_WIDTH coreConsultant parameter.</description>
                  <lsb>15</lsb>
                  <msb>16</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_32</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_64</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_128</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_256</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>M3HDATAWIDTH</name>
                  <description>The value of this register is derived from the DMAH_M3_HDATA_WIDTH coreConsultant parameter.</description>
                  <lsb>17</lsb>
                  <msb>18</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_32</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_64</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_128</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_256</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>M2HDATAWIDTH</name>
                  <description>The value of this register is derived from the DMAH_M2_HDATA_WIDTH coreConsultant parameter.</description>
                  <lsb>19</lsb>
                  <msb>20</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_32</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_64</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_128</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_256</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>M1HDATAWIDTH</name>
                  <description>The value of this register is derived from the DMAH_M1_HDATA_WIDTH coreConsultant parameter.</description>
                  <lsb>21</lsb>
                  <msb>22</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_32</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_64</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_128</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DATA_BUS_WIDTH_256</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>NUMHSINT</name>
                  <description>The value of this register is derived from the DMAH_NUM_HS_INT coreConsultant parameter.</description>
                  <lsb>23</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>HS_INTERFACE_0</name>
                      <description>Unspecified</description>
                      <value>0x00</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_1</name>
                      <description>Unspecified</description>
                      <value>0x01</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_2</name>
                      <description>Unspecified</description>
                      <value>0x02</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_3</name>
                      <description>Unspecified</description>
                      <value>0x03</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_4</name>
                      <description>Unspecified</description>
                      <value>0x04</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_5</name>
                      <description>Unspecified</description>
                      <value>0x05</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_6</name>
                      <description>Unspecified</description>
                      <value>0x06</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_7</name>
                      <description>Unspecified</description>
                      <value>0x07</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_8</name>
                      <description>Unspecified</description>
                      <value>0x08</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_9</name>
                      <description>Unspecified</description>
                      <value>0x09</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_a</name>
                      <description>Unspecified</description>
                      <value>0x0A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_b</name>
                      <description>Unspecified</description>
                      <value>0x0B</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_c</name>
                      <description>Unspecified</description>
                      <value>0x0C</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_d</name>
                      <description>Unspecified</description>
                      <value>0x0D</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_e</name>
                      <description>Unspecified</description>
                      <value>0x0E</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_f</name>
                      <description>Unspecified</description>
                      <value>0x0F</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HS_INTERFACE_10</name>
                      <description>Unspecified</description>
                      <value>0x10</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ADDENCODEDPARAMS</name>
                  <description>The value of this register is derived from the DMAH_ADD_ENCODED_PARAMS coreConsultant parameter.</description>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STATICENDIANSELECT</name>
                  <description>The value of this register is derived from the DMAH_STATIC_ENDIAN_SELECT coreConsultant parameter.</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMACOMPSID0</name>
              <description>This is the DW_ahb_dmac Component Version register, which is a read-only register that specifies the component type.</description>
              <addressOffset>0x060</addressOffset>
              <access>read-write</access>
              <resetValue>0x44571110</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMACOMPTYPE</name>
                  <description>DMA Component Type Number = `h44571110.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMACOMPSID1</name>
              <description>This is the DW_ahb_dmac Component Version register, which is a read-only register that specifies the version of the packaged component.</description>
              <addressOffset>0x064</addressOffset>
              <access>read-write</access>
              <resetValue>0x3232322A</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMACOMPVERSION</name>
                  <description>DMA Component Version.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
