ankuns/nrfx/bsp/stable/mdk/nrf7140_lmac.svd
          <register>
            <name>INTFORCEBNDRYFRAMEFATAL</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_BNDRY_FRAME_FATAL interrupt events individually, without the need to activate the conditions that trigger the interrupt sources, since it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x288</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFBNDRYMATCHVC0</name>
                <description>Force err_f_bndry_match_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC1</name>
                <description>Force err_f_bndry_match_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC2</name>
                <description>Force err_f_bndry_match_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC3</name>
                <description>Force err_f_bndry_match_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC4</name>
                <description>Force err_f_bndry_match_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC5</name>
                <description>Force err_f_bndry_match_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC6</name>
                <description>Force err_f_bndry_match_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC7</name>
                <description>Force err_f_bndry_match_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC8</name>
                <description>Force err_f_bndry_match_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC9</name>
                <description>Force err_f_bndry_match_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC10</name>
                <description>Force err_f_bndry_match_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC11</name>
                <description>Force err_f_bndry_match_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC12</name>
                <description>Force err_f_bndry_match_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC13</name>
                <description>Force err_f_bndry_match_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC14</name>
                <description>Force err_f_bndry_match_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC15</name>
                <description>Force err_f_bndry_match_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTSEQFRAMEFATAL</name>
            <description>Fatal interruption related with incorrect Frame sequence for a specific virtual channel.</description>
            <addressOffset>0x290</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFSEQVC0</name>
                <description>Incorrect Frame sequence detected in virtual channel 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC1</name>
                <description>Incorrect Frame sequence detected in virtual channel 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC2</name>
                <description>Incorrect Frame sequence detected in virtual channel 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC3</name>
                <description>Incorrect Frame sequence detected in virtual channel 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC4</name>
                <description>Incorrect Frame sequence detected in virtual channel 4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC5</name>
                <description>Incorrect Frame sequence detected in virtual channel 5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC6</name>
                <description>Incorrect Frame sequence detected in virtual channel 6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC7</name>
                <description>Incorrect Frame sequence detected in virtual channel 7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC8</name>
                <description>Incorrect Frame sequence detected in virtual channel 8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC9</name>
                <description>Incorrect Frame sequence detected in virtual channel 9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC10</name>
                <description>Incorrect Frame sequence detected in virtual channel 10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC11</name>
                <description>Incorrect Frame sequence detected in virtual channel 11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC12</name>
                <description>Incorrect Frame sequence detected in virtual channel 12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC13</name>
                <description>Incorrect Frame sequence detected in virtual channel 13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC14</name>
                <description>Incorrect Frame sequence detected in virtual channel 14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFSEQVC15</name>
                <description>Incorrect Frame sequence detected in virtual channel 15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKSEQFRAMEFATAL</name>
            <description>Interrupt mask for INT_ST_SEQ_FRAME_FATAL controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x294</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFSEQVC0</name>
                <description>Mask for err_f_seq_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRFSEQVC1</name>
                <description>Mask for err_f_seq_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRFSEQVC2</name>
                <description>Mask for err_f_seq_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRFSEQVC3</name>
                <description>Mask for err_f_seq_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRFSEQVC4</name>
                <description>Mask for err_f_seq_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRFSEQVC5</name>
                <description>Mask for err_f_seq_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRFSEQVC6</name>
                <description>Mask for err_f_seq_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRFSEQVC7</name>
                <description>Mask for err_f_seq_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRFSEQVC8</name>
                <description>Mask for err_f_seq_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRFSEQVC9</name>
                <description>Mask for err_f_seq_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRFSEQVC10</name>
                <description>Mask for err_f_seq_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRFSEQVC11</name>
                <description>Mask for err_f_seq_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRFSEQVC12</name>
                <description>Mask for err_f_seq_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRFSEQVC13</name>
                <description>Mask for err_f_seq_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRFSEQVC14</name>
                <description>Mask for err_f_seq_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRFSEQVC15</name>
                <description>Mask for err_f_seq_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCESEQFRAMEFATAL</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_SEQ_FRAME_FATAL interrupt events individually. There is no need to activate the conditions that trigger the interrupt sources, because it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x298</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFSEQVC0</name>
                <description>Force err_f_seq_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRFSEQVC1</name>
                <description>Force err_f_seq_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRFSEQVC2</name>
                <description>Force err_f_seq_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRFSEQVC3</name>
                <description>Force err_f_seq_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRFSEQVC4</name>
                <description>Force err_f_seq_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRFSEQVC5</name>
                <description>Force err_f_seq_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRFSEQVC6</name>
                <description>Force err_f_seq_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRFSEQVC7</name>
                <description>Force err_f_seq_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRFSEQVC8</name>
                <description>Force err_f_seq_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRFSEQVC9</name>
                <description>Force err_f_seq_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRFSEQVC10</name>
                <description>Force err_f_seq_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRFSEQVC11</name>
                <description>Force err_f_seq_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRFSEQVC12</name>
                <description>Force err_f_seq_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRFSEQVC13</name>
                <description>Force err_f_seq_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRFSEQVC14</name>
                <description>Force err_f_seq_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRFSEQVC15</name>
                <description>Force err_f_seq_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTCRCFRAMEFATAL</name>
            <description>Fatal interruption related with Frames with at least one CRC error for a specific virtual channel.</description>
            <addressOffset>0x2A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFRAMEDATAVC0</name>
                <description>Last received Frame in virtual channel 0, had at least one CRC error.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC1</name>
                <description>Last received Frame in virtual channel 1, had at least one CRC error.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC2</name>
                <description>Last received Frame in virtual channel 2, had at least one CRC error.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC3</name>
                <description>Last received Frame in virtual channel 3, had at least one CRC error.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC4</name>
                <description>Last received Frame in virtual channel 4, had at least one CRC error.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC5</name>
                <description>Last received Frame in virtual channel 5, had at least one CRC error.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC6</name>
                <description>Last received Frame in virtual channel 6, had at least one CRC error.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC7</name>
                <description>Last received Frame in virtual channel 7, had at least one CRC error.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC8</name>
                <description>Last received Frame in virtual channel 8, had at least one CRC error.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC9</name>
                <description>Last received Frame in virtual channel 9, had at least one CRC error.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC10</name>
                <description>Last received Frame in virtual channel 10, had at least one CRC error.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC11</name>
                <description>Last received Frame in virtual channel 11, had at least one CRC error.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC12</name>
                <description>Last received Frame in virtual channel 12, had at least one CRC error.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC13</name>
                <description>Last received Frame in virtual channel 13, had at least one CRC error.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC14</name>
                <description>Last received Frame in virtual channel 14, had at least one CRC error.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFRAMEDATAVC15</name>
                <description>Last received Frame in virtual channel 15, had at least one CRC error.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
