ankuns/nrfx/bsp/stable/mdk/nrf7140_lmac.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120">
      <name>GLOBAL_DPPIC134</name>
      <description>Distributed programmable peripheral interconnect controller 5</description>
      <baseAddress>0x5F9B1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER132</name>
      <description>Timer/Counter 4</description>
      <baseAddress>0x5F9B2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER133</name>
      <description>Timer/Counter 5</description>
      <baseAddress>0x5F9B3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120">
      <name>GLOBAL_PWM131</name>
      <description>Pulse width modulation unit 2</description>
      <baseAddress>0x5F9B4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM132</name>
      <description>Serial Peripheral Interface Master with EasyDMA 6</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS132</name>
      <description>SPI Slave 3</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM132</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS132</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE132</name>
      <description>UART with EasyDMA 3</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM133</name>
      <description>Serial Peripheral Interface Master with EasyDMA 7</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS133</name>
      <description>SPI Slave 4</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM133</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 3</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS133</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 3</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE133</name>
      <description>UART with EasyDMA 4</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PDM130">
      <name>GLOBAL_PDM131</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 1</description>
      <baseAddress>0x5F9B7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120">
      <name>GLOBAL_DPPIC135</name>
      <description>Distributed programmable peripheral interconnect controller 6</description>
      <baseAddress>0x5F9C1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER134</name>
      <description>Timer/Counter 6</description>
      <baseAddress>0x5F9C2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER135</name>
      <description>Timer/Counter 7</description>
      <baseAddress>0x5F9C3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
